Masmiseim36/nxpSDK/boards/frdmk32l3a6/wifi_qca_examples/qca_throughput/cm4/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* PORTB9 (number 57), IRQ */
#define BOARD_INITSILEX2401SHIELD_IRQ_GPIO                                 GPIOB   /*!< GPIO device name: GPIOB */
#define BOARD_INITSILEX2401SHIELD_IRQ_PORT                                 PORTB   /*!< PORT device name: PORTB */
#define BOARD_INITSILEX2401SHIELD_IRQ_GPIO_PIN                               14U   /*!< PORTB pin index: 14 */
#define BOARD_INITSILEX2401SHIELD_IRQ_PIN_NAME                             PTB14   /*!< Pin name */
#define BOARD_INITSILEX2401SHIELD_IRQ_LABEL                                "IRQ"   /*!< Label */
#define BOARD_INITSILEX2401SHIELD_IRQ_NAME                                 "IRQ"   /*!< Identifier name */
#define BOARD_INITSILEX2401SHIELD_IRQ_DIRECTION              kGPIO_DigitalOutput   /*!< Direction */

/* PORTB23 (number 69), PWRON */
#define BOARD_INITSILEX2401SHIELD_PWRON_GPIO                               GPIOA   /*!< GPIO device name: GPIOA */
#define BOARD_INITSILEX2401SHIELD_PWRON_PORT                               PORTA   /*!< PORT device name: PORTA */
#define BOARD_INITSILEX2401SHIELD_PWRON_GPIO_PIN                             27U   /*!< PORTA pin index: 27 */
#define BOARD_INITSILEX2401SHIELD_PWRON_PIN_NAME                           PTA27   /*!< Pin name */
#define BOARD_INITSILEX2401SHIELD_PWRON_LABEL                            "PWRON"   /*!< Label */
#define BOARD_INITSILEX2401SHIELD_PWRON_NAME                             "PWRON"   /*!< Identifier name */
#define BOARD_INITSILEX2401SHIELD_PWRON_DIRECTION            kGPIO_DigitalOutput   /*!< Direction */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSilex2401Shield(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
